# В диапазоне натуральных чисел от 2 до 99 определить, сколько из них кратны любому из чисел в диапазоне от 2 до 9.
# 1 вариант
# a = [0 for i in range(8)]
a = [0] * 8
b = [i for i in range(2, 100)]

for i in b:
    if i % 2 == 0:
        a[0] += 1
    if i % 3 == 0:
        a[1] += 1
    if i % 4 == 0:
        a[2] += 1
    if i % 5 == 0:
        a[3] += 1
    if i % 6 == 0:
        a[4] += 1
    if i % 7 == 0:
        a[5] += 1
    if i % 8 == 0:
        a[6] += 1
    if i % 9 == 0:
        a[7] += 1
print(a)

# 2 вариант
a = [0] * 8
i = 2

while i <= 9:
    for num in b:
        if num % i == 0:
            a[i - 2] += 1
    i += 1
print(a)